var textArr = [];

//350508
textArr.push('하나님은 6천년간 사단과 전쟁을 해 왔다. 그러나 오늘의 이 전쟁은 하나님이 이미 이겨놓고 하시는 것이다.');
textArr.push('우리는 하나님 보시기에도, 내 자신이 보기에도 저 이스라엘보다 월등히 나아야 한다. 하나님의 씨로 난 사람이라면 믿음도 행함도 있어야 하나님의 가족이라 할 수 있다.');
textArr.push('각 지파 12,000 완성되면 흰무리가 많이 온다. 흰무리가 오고 나면 다음은 첫째부활 참예다. 하나하나 단계적으로 이루어진다.');
textArr.push('순교자들은 이 말씀을 오늘의 우리에게 전해주다 순교했다. 그 분들이 전해준 이 말씀을 읽을 때는 정말 우리 위해 순교하신 그 영들과 우리가 함께 산다는 생각으로 읽어야 한다. 우리는 순교자들에게 은혜를 입었기에 그들에게 고맙다고 생각해야 하고, 그들이 전해 준 말을 지켜야 한다.');
textArr.push('심청전도 읽는 사람 감동되어 눈물 흘리는데, 우리 위해 죽은 그 분들에 대한 기록 읽으며 감동이 없으면 안 된다. 초림 당시 예수님을 따르고 증거하던 대다수가 순교했다.');
textArr.push('약속하고 이루는 능력이 실력이다. 하나님은 창조력이 있어 예언하고 이루신다. 그러나 마귀는 피조물이기에 창조력이 없어 예언도 그 일을 이룰 능력도 없다. 지구촌 수많은 종교가 있으나 성경 외에는 예언도 이룬 것도 없다. 오직 성경만이 예언과 성취가 담긴 참된 경서이다.');
textArr.push('하나님의 6천년 역사는 계시록 이것 하나 이루기 위한 것이었다. 배도, 멸망, 구원 셋 중 구원의 역사 12지파 이루기 위한 역사였다. 하나님께서 6천년간 하시고자 한 그 일이 바로 이 12지파이다. 그만큼 이 12지파가 중요하다.');
textArr.push('지구촌 73억 인구가 있고 종교인도 많지만 하나님의 목적은 바로 이 계시록 12지파이다. 이 12지파 144,000이 제사장이고 하나님 나라다.');
textArr.push('신앙인은 똑똑하고 확실해야 한다. 무엇을 하든 분명하고 확실해야 한다.');
textArr.push('144,000 인치는 일 스톱되면 무언가 큰 환난이 하나 일어나게 된다. 그리고 거기서 수많은 흰무리가 나오게 된다(계7:9~14).');
textArr.push('우리는 하나님이 애써 만들어 놓으신 계시록을 완벽하게 알아야 한다. 그래야 절대적인 믿음을 갖게 된다.');
textArr.push('어디든지 여기보다 나은 진리가 있다면 그리로 가야 한다. 여기보다 나은 진리가 있다면 가지고 와보라는 것이다. 하나님의 마지막 역사 계시록이 이룬 곳은 여기 말고 그 어디에도 없다. 하나님은 이 이상 더 약속한 것이 없다. 이 계시록 하나 이룸으로 끝나는 것이다.');
textArr.push('생명책에 녹명되었다 할지라도 도말되는 것도 있고 흐려지는 것도 있다. 그렇기에 자기 믿음은 자기가 지켜야 한다.');
textArr.push('아담에게 모든 것을 유업으로 주신 것처럼, 오늘날도 우리에게 조그마한 것이 아니고 이 지구촌 전체를 유업으로 주신 것이다.');
textArr.push('하나님이 함께한다면 모든 것이 다 잘 된다. 해외 나갈 때도 “하나님. 저희와 함께 가셔야 저희도 가지, 안 그러면 안 갑니다.” 모세처럼 부탁했다. “하나님이 함께 가셔서 만나는 사람 마음을 주관해주셔야 제가 일을 하지 않습니까.” 부탁을 한 것이다. 그러니 가는 곳마다 사람들이 그렇게 좋아라 한 것이다.');
textArr.push('우리가 교회에 나아올 때에는 ‘천국 간다. 오늘 가서 천국에 가서 앉는다.’는 그런 마음으로 와야 한다.');
textArr.push('6천년 역사 중 오늘날 신천지의 계시 말씀은 최고의 진리다. 모든 감추어져 있던 것을 다 드러낸 최고의 진리다.');
textArr.push('육신의 양식이 있고 정신의 양식이 있다. 하나님의 양식은 정신의 양식이다.');
textArr.push('하나님은 나(총회장님)에게 장래 일을 여러 차례 보여주셨다. 우리가 바라고 원하는 미래의 모든 모습들은 상상할 수 없을 정도로 아름답다(롬8:18).');
textArr.push('나라와 제사장, 이들이 이 모든 지구촌을 지배하게 되고 만국을 통치한다. 철장 받은 사람이 있는 그 나라가 세계를 주관하게 된다. 핵으로도 돈으로도 세계를 주관할 수 없으며, 하나님의 말씀으로 세계를 주관하게 된다. 우리는 상상도 할 수 없는 큰 복을 받게 된다.');
textArr.push('모든 약속은 오늘날 계시록이 이루어지고 나면 더 이상 없다. 계시록을 이루는 일이 끝이다.');
textArr.push('현재 144,000 거의 찼다. 이제 환난이 일어나 큰 흰무리가 몰려오게 된다. 오늘 올는지 내일 올는지, 하나님 보시기에 인 맞은 자 144,000이 되면 큰 환난이 일어나서 많은 사람이 온다. 144,000만 이루어지면 그 다음은 전도하는게 아니라 환난이 일어나 많은 사람이 오게 되는 것이다.');
textArr.push('우리 자신들도 상상할 수 없을 정도의 큰 복을 받게 된다. 세상적인 저런 복이 아니다. 영원히 사는 복이다.');
textArr.push('계5장에 피로 사서 하나님의 나라 제사장을 만들었다면, 5장이 이루어지기 전에는 하나님의 나라도 없고 제사장도 없다.');
textArr.push('첫 장막 목자들이 게으르고 나태해서 첫 장막이 삼켜진 것을 나는 다 보았다. 우리는 게으르고 나태하면 안 된다.');
textArr.push('하나님의 자녀라면 어떤 것이라도 세상 사람보다 나아야 한다. 하늘이 이렇게 못난 우리를 구원해주셔서 하나님의 자녀로 삼아주시려 한다면 그 은혜에 보답해야 하지 않겠는가.');
textArr.push('바보는 천국 못 간다. 세상보다 몇백 배 나아야 한다.');
textArr.push('우리는 세계적 차원을 가지고 움직이고 있다. 사사로운 것 생각하면 안 된다.');
textArr.push('개인의 욕심, 권세만 생각하는 것은 이방인이나 한기총이 하는 것이다.');
textArr.push('뿌리는 원체와 가지와 잎 모두와 연결되어 있다. 어느 것 하나 막히면 안되듯 각자의 사명을 다해야 한다. 뿌리는 뿌리의 사명을 다하는 것이고, 원체는 원체의 사명을 다하는 것이다. 그래야 가지도 나고, 꽃도 피고, 잎은 공기를 뿌리까지 내려주고. 이처럼 각자가 맡은 사명을 충실히 이행해 줄 때 그 조직이 살고 완전해진다.');
textArr.push('계22:12. 각 사람의 일한대로 갚아준다고 하셨다. 이것을 한시라도 잊어서는 안 된다.');
textArr.push('현재 20만 명 중에 144,000이 되기 위해 스스로 노력해야 한다. 나 자신이 144,000속에 들어가는게 중요하다.');
textArr.push('씨 뿌리고 인치고 추수된 것의 실상이 나 자신이다. 우리가 추수된 실상이다.');
textArr.push('철장권세는 온 세계를 다스리는 권세라는 뜻이다. 철장권세 가진 자가 남북통일 못 시키겠는가.');
textArr.push('예수님의 십자가 피 흘리신 일, 하나님의 6천년 역사의 모든 일은 계시록의 마지막 역사 우리 신천지 하나를 이루기 위한 것이었다. 6천년 수많은 사람 중에 하나님이 신천지 하나 이루려고 지금까지 일해오신 것이다.');
textArr.push('이 계시록의 역사는 알파와 오메가라는 말처럼 시작도 있고 끝도 있다. 언제까지나 이런 것이 아니다. 약속한 것 이루면 끝이고, 더 이룰 것도 없고 끝난다.');
textArr.push('73억 중 144,000. 아주 적은 숫자다. 한 곳에 적은 숫자 창조해 놓고 그들이 하나님의 가족이고 영원히 하나님과 함께 살 사람들이라고 하신다. 하나님은 본래같이 회복하기 위해 6천년 역사를 하셨다.');
textArr.push('하나님은 오늘날 이 역사를 이루면 끝나는 것이다. 배도자나 멸망자가 목적이 아니다. 새 나라 새 민족 이것 이루기 위해 예수님이 십자가 진 것이다.');
textArr.push('다시 오시는 하나님과 영계 천국은 하나님의 나라 열두지파에 오신다. 하늘에서 이룬 것 같이 이룬 이곳에 함께함으로 이곳은 죽음도 고통도 없어진다. 하나님이 창조하신 열두지파. 이것 하나 이루기 위해 육천년 간 약속하시고 일해 오신 것이다.');
textArr.push('6천년 세계 속에 최고의 하나님 나라와 하나님의 자녀가 된 12지파. 이보다 더 큰 것, 더 큰 복은 없다. 천지를 유업으로 받게 된다. 영원히 사는 세계의 나 자신이 되기 위한 신앙이다. 이 일이 오늘날 우리 신천지에서 이루어지는 것이다.');
textArr.push('우리는 세계 민족 중 최고의 복을 받는다. 세상 어떤 과학이나 지식으로도 깨닫지 못하는 이런 대복을 받을 우리 12지파다. 그러니 게을러서는 안 된다. 세상 대통령 하나 하려 해도 얼마나 노력을 해야 하고, 국회의원 하나 잠깐 하는 그것도 얼마나 노력을 해야 하는데, 오늘날 이 지구촌의 주인이 되고 영원히 하나님과 함께 사는 존재가 될 사람들이 게으르거나 나태하면 안 된다.');
textArr.push('현재 20만이라 할지라도, 하나님 보시기에 인 맞은 자로 인정되는 사람만이 144,000이다.');

$(document).ready(function(){
	var randNum = Math.floor(Math.random()*textArr.length);
	$(".text-area").html(textArr[randNum]);
	$(".bottom-text").html((randNum+1)+" / "+textArr.length);

	$(".left-arrow").on("click",function(){
		randNum--;
		if(randNum<0) randNum = textArr.length-1;
		$(".text-area").html(textArr[randNum]);
		$(".bottom-text").html((randNum+1)+" / "+textArr.length);
	});

	$(".right-arrow").on("click",function(){
		randNum++;
		if(randNum>=textArr.length) randNum = 0;
		$(".text-area").html(textArr[randNum]);
		$(".bottom-text").html((randNum+1)+" / "+textArr.length);
	});

	$(".right-big-arrow").on("click",function(){
		var randNum = Math.floor(Math.random()*textArr.length);
		$(".text-area").html(textArr[randNum]);
		$(".bottom-text").html((randNum+1)+" / "+textArr.length);
	});

	$(".mid").on("click",function(){
		toast("복사되었습니다.",3000);
		var windowWidth = window.innerWidth;
		var toastWidth = $(".toast").width();
		$("#toast-container").attr("style","left:"+((windowWidth-toastWidth)/2)+"px !important");

	});


});

var clipboard = new Clipboard('.mid', {
	text: function() {
		return $(".text-area").html();
	}
});

clipboard.on('success', function(e) {
	console.log(e);
});